**Query1:Write a command to find the total number of employees corresponding to each Location and Avg Salary in those Locations**

SELECT Location,COUNT(*) As Tot_Emp_Per_Loc ,SUM(Salary) As Avg_Salary
FROM employee
GROUP BY Location;

**Output:**

Location, Tot_Emp_Per_Loc, Avg_Salary

'Bengaluru', '3', '170000'
'Gurugram', '3', '170000'
'Mumbai', '1', '50000'
'Noida', '1', '10000'

**JOIN** -- Whenever a JOIN comman dis used in SQL Query by Default it is taken as INNER JOIN.

INNER JOIN -- Can join two tables.

Example - Join tables table1 ,table2

The Output of JOIN is the Intersection of two tables..i.e the common entity from the two tables is obtained.

**Example Query: Write a command to find the total number of employees corresponding to each Location and Avg Salary in those Locations
Also display Firstname ,LastName corresponding to each record.**

SELECT FirstName,Lastname ,employee.Location ,Tot_Emp_Per_Loc,Avg_Salary
FROM employee
JOIN
(SELECT Location,COUNT(Location) As Tot_Emp_Per_Loc ,AVG(Salary) As Avg_Salary FROM employee
GROUP BY Location) As temp_tbl
ON employee.Location =temp_tbl.Location;


**Output**

FirstName, Lastname, Location, Tot_Emp_Per_Loc, Avg_Salary

'Priya', 'Bhatia', 'Bengaluru', '3', '170000'
'Sumedha', 'Midha', 'Gurugram', '3', '170000'
'Rashmi', 'Tanwar', 'Bengaluru', '3', '170000'
'Shivam', 'Mishra', 'Noida', '1', '10000'
'Ajay', 'Bhatia', 'Mumbai', '1', '50000'
'Alia', 'Bhatt', 'Gurugram', '3', '170000'

**WINDOW FUNCTIONS**

**1. PARTITION BY**- This works similar to GROUP BY , but it allows Non-aggregation columns also to be **display**.

**PARTION BY Location --is telling that Grouping is done on Location ..which is similar to GROUP BY**

** PARTION BY is USED WHEN WE WANT TO DISPALY THE NON_AGGREGATE COLUMNS**


** QUERY USING JOIN AND GROUP BY**
SELECT FirstName,Lastname ,employee.Location ,Tot_Emp_Per_Loc,Avg_Salary
FROM employee
JOIN
(SELECT Location,COUNT(Location) As Tot_Emp_Per_Loc ,AVG(Salary) As Avg_Salary FROM employee
GROUP BY Location) As temp_tbl
ON employee.Location =temp_tbl.Location;


EXAMPLE : ** OPTIMIZE the above Query Using Window Functions--**---

Write a command to find the total number of employees corresponding to each Location and Avg Salary in those Locations
Also display Firstname ,LastName corresponding to each record.**/


** PARTION BY is USED WHEN WE WANT TO DISPALY THE NON_AGGREGATE COLUMNS**

SELECT FirstName,LastName,Location,
COUNT(Location) OVER (PARTITION BY Location) AS Total ,
AVG(Salary) OVER(PARTITION BY Location) As AVG_Salary
FROM employee;

**OUTPUT**

FirstName, LastName, Location, Total, AVG_Salary

'Priya', 'Bhatia', 'Bengaluru', '3', '56666.6667'
'Rashmi', 'Tanwar', 'Bengaluru', '3', '56666.6667'
'Jitendra', 'Mishra', 'Bengaluru', '3', '56666.6667'
'Sumedha', 'Midha', 'Gurugram', '3', '56666.6667'
'Alia', 'Bhatt', 'Gurugram', '3', '56666.6667'
'Sanya', 'Bhatt', 'Gurugram', '3', '56666.6667'
'Ajay', 'Bhatia', 'Mumbai', '1', '50000.0000'
'Shivam', 'Mishra', 'Noida', '1', '10000.0000'



**2. ROW_NUMBER**-THis will map the values with the Numbers on the basis of Sorted Values.

**ROW_NUMBER** has to be always be used with **ORDER BY**(used on Sorted Data)



**Query1: Create a New Column "Priority" and Number it based on hte Salary of the Employee. For the Highest paid employee ,
the Priority should be Set as ! and So on**


SELECT FirstName,LastName,Salary,
ROW_NUMBER() OVER (ORDER BY Salary DESC) AS Priority_Emp
FROM employee;

**Output**

FirstName, LastName, Salary, Priority_Emp

'Priya', 'Bhatia', '100000', '1'
'Jeevan', 'Mishra', '100000', '2'
'Sanya', 'Bhatt', '70000', '3'
'Sumedha', 'Midha', '50000', '4'
'Ajay', 'Bhatia', '50000', '5'
'Alia', 'Bhatt', '50000', '6'
'Jitendra', 'Mishra', '50000', '7'
'Akash', 'Kumar', '50000', '8'
'Rashmi', 'Tanwar', '20000', '9'
'Shivam', 'Mishra', '10000', '10'

**3.RANK()**
** We obeserve from the above Output that the employees who have the same Salary have ben given different Priority,which is Not correct. Row_Number() looks at teh EMp_ID and gives the higher Priority ,which comes first.

To handle this Issue we need to understand the concept of **"RANK"**.


SELECT FirstName,LastName,Salary,
RANK() OVER(ORDER BY Salary DESC) As Priority_Emp
FROM employee;

**Output**

FirstName, LastName, Salary, Priority_Emp

Ajay	Bhatia	50000	4
Akash	Kumar	50000	4
Alia	Bhatt	50000	4
Jeevan	Mishra	100000	1
Jitendra	Mishra	50000	4
Priya	Bhatia	100000	1
Rashmi	Tanwar	20000	9
Sanya	Bhatt	70000	3
Shivam	Mishra	10000	10
Sumedha	Midha	50000	4

**DENSE_RANK()**

We obeserve from the above Output that since same Priority is assigned to the People gettingsame Salary ,the Next level is skipped for the number of times it is repeated ,which is not a correct method. To handlethis we we use a method called **Dense_Rank()**.

**QUERY**
/** DENSE_RANK() is USed to handle the issue that is seen with RANK()**/

SELECT FirstName,LastName,Salary,
DENSE_RANK() OVER(ORDER BY Salary DESC) As Priority_Emp
FROM employee;

**OUTPUT**

FirstName, LastName, Salary, Priority_Emp

'Ajay', 'Bhatia', '50000', '3'
'Akash', 'Kumar', '50000', '3'
'Alia', 'Bhatt', '50000', '3'
'Jeevan', 'Mishra', '100000', '1'
'Jitendra', 'Mishra', '50000', '3'
'Priya', 'Bhatia', '100000', '1'
'Rashmi', 'Tanwar', '20000', '4'
'Sanya', 'Bhatt', '70000', '2'
'Shivam', 'Mishra', '10000', '5'
'Sumedha', 'Midha', '50000', '3'

**INTERVIEW QUESTION-What is the difference between ROW_NUMBER(),RANK() and DENSE_RANK()?**

**Ans: ROW_NUMBER()-will map the values with the Numbers on the basis of Sorted Values.

In Row_Number()-Even though the Salary was same for multiple employees ,it assigned different Priority Level.It assigns the hiher Priority for the Id that comes first.

RANK()- To handle the isssue that occured in Row_Number(),Rank() is used so that it assigns the same Priority of the employees with the same Salary.

But when multiple employees are assigned the same Priority,it skips the consicutive Number, for which the number of times the Present Level is repeated.

DENSE_RANK()- To handle the isssue that occured in RANK(),Dense_Rank() is used ,so that it assigns the same Priority of the employees with the same Salary.when multiple employees are assigned the same Priority,it does not skip the consicutive Number, for which the number of times the Present Level is repeated.**


**NOTE: IF there are no diuplicate records, ROW_NUMBER(),RANK(),DENSE_RANK() will all work the same ie it Returns the SAME ANSWER**